# ハノイの塔を解く

# no:円盤の枚数
# x :開始軸
# y :目的軸
# 6-x-y :中間軸 
#   開始軸、中間軸、目的軸の3本の軸をそれぞれ1,2,3とすると、
#   1+2+3=6  6から開始軸と目的軸を引くと中間軸になる
def move(no, x, y)
	if no > 1 then
		move(no-1, x, 6-x-y)
	end

	printf("[%d]を%d軸から%d軸へ移動\n", no, x, y);

	if no > 1 then
		move(no-1, 6-x-y, y)
	end
end

# 円盤の枚数を入力
printf("円盤の枚数：")
no = gets.to_i

move(no, 1, 3)

# 円盤4枚の時のmove呼び出しの要す
# moveが呼ばれる度に２分木を深く潜る
#   no,x,y を表す  ()内の数値はprintf呼び出しの順番
#                                                (8)4,1,3
#                             /                                            \
#                     (4)3,1,2                                                (12)3,2,3
#                  /              \                                      /                  \
#         (2)2,1,3                  (6)2,3,2                    (10)2,2,1                    (14)2,1,3
#         /       \                /        \                   /        \                  /         |
# (1)1,1,2         (3)1,2,3  (5)1,3,1        (7)1,1,2   (9)1,2,3          (11)1,3,1  (13)1,1,2         (15)1,2,3
